In [1]:
import pandas as pd
import numpy as np

In [8]:
india_weather = pd.DataFrame({
    'city':['Bhopal','Indore','Mumbai'],
    'temperature':[45,50,39]
})
india_weather

us_weather = pd.DataFrame({
    'city':['NY','Chicago','SW'],
    'temperature':[48,30,39]})
us_weather

      city  temperature
0       NY           48
1  Chicago           30
2       SW           39

In [13]:
#concate perform when it want to do join colmn
pd.concat([india_weather,us_weather])

      city  temperature
0   Bhopal           45
1   Indore           50
2   Mumbai           39
0       NY           48
1  Chicago           30
2       SW           39

In [15]:
pd.concat([india_weather,us_weather],ignore_index=True) #if we dont want index then enable ignore_index

      city  temperature
0   Bhopal           45
1   Indore           50
2   Mumbai           39
3       NY           48
4  Chicago           30
5       SW           39

In [16]:
pd.concat([india_weather,us_weather],keys=['India','USA']) #if want to describe according to india and USA

            city  temperature
India 0   Bhopal           45
      1   Indore           50
      2   Mumbai           39
USA   0       NY           48
      1  Chicago           30
      2       SW           39